OpenPuya/PY32T020_Firmware/Drivers/PY32T020_HAL_Driver/Inc/py32t020_ll_i2c.h
/** @defgroup I2C_LL_Exported_Functions I2C Exported Functions
  * @{
  */

/** @defgroup I2C_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable I2C peripheral (PE = 1).
  * @rmtoll CR1          PE            LL_I2C_Enable
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_Enable(I2C_TypeDef *I2Cx)
{
  SET_BIT(I2Cx->CR1, I2C_CR1_PE);
}

/**
  * @brief  Disable I2C peripheral (PE = 0).
  * @rmtoll CR1          PE            LL_I2C_Disable
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_Disable(I2C_TypeDef *I2Cx)
{
  CLEAR_BIT(I2Cx->CR1, I2C_CR1_PE);
}

/**
  * @brief  Check if the I2C peripheral is enabled or disabled.
  * @rmtoll CR1          PE            LL_I2C_IsEnabled
  * @param  I2Cx I2C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabled(I2C_TypeDef *I2Cx)
{
  return (READ_BIT(I2Cx->CR1, I2C_CR1_PE) == (I2C_CR1_PE));
}

/**
  * @brief  Enable Clock stretching.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll CR1          NOSTRETCH     LL_I2C_EnableClockStretching
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_EnableClockStretching(I2C_TypeDef *I2Cx)
{
  CLEAR_BIT(I2Cx->CR1, I2C_CR1_NOSTRETCH);
}

/**
  * @brief  Disable Clock stretching.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll CR1          NOSTRETCH     LL_I2C_DisableClockStretching
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_DisableClockStretching(I2C_TypeDef *I2Cx)
{
  SET_BIT(I2Cx->CR1, I2C_CR1_NOSTRETCH);
}

/**
  * @brief  Check if Clock stretching is enabled or disabled.
  * @rmtoll CR1          NOSTRETCH     LL_I2C_IsEnabledClockStretching
  * @param  I2Cx I2C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledClockStretching(I2C_TypeDef *I2Cx)
{
  return (READ_BIT(I2Cx->CR1, I2C_CR1_NOSTRETCH) != (I2C_CR1_NOSTRETCH));
}

/**
  * @brief  Enable General Call.
  * @note   When enabled the Address 0x00 is ACKed.
  * @rmtoll CR1          ENGC          LL_I2C_EnableGeneralCall
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_EnableGeneralCall(I2C_TypeDef *I2Cx)
{
  SET_BIT(I2Cx->CR1, I2C_CR1_ENGC);
}

/**
  * @brief  Disable General Call.
  * @note   When disabled the Address 0x00 is NACKed.
  * @rmtoll CR1          ENGC          LL_I2C_DisableGeneralCall
  * @param  I2Cx I2C Instance.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_DisableGeneralCall(I2C_TypeDef *I2Cx)
{
  CLEAR_BIT(I2Cx->CR1, I2C_CR1_ENGC);
}

/**
  * @brief  Check if General Call is enabled or disabled.
  * @rmtoll CR1          ENGC          LL_I2C_IsEnabledGeneralCall
  * @param  I2Cx I2C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledGeneralCall(I2C_TypeDef *I2Cx)
{
  return (READ_BIT(I2Cx->CR1, I2C_CR1_ENGC) == (I2C_CR1_ENGC));
}

/**
  * @brief  Enable Wakeup from STOP.
  * @note   The macro IS_I2C_WAKEUP_FROMSTOP_INSTANCE(I2Cx) can be used to check whether or not
  *         WakeUpFromStop feature is supported by the I2Cx Instance.
  * @note   This bit can only be programmed when Digital Filter is disabled.
  * @rmtoll CR1          WUPEN         LL_I2C_EnableWakeUpFromStop
  * @param  I2Cx I2C Instance.
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_EnableWakeUpFromStop(I2C_TypeDef *I2Cx)
{
  SET_BIT(I2Cx->CR1, I2C_CR1_WUPEN);
}

/**
  * @brief  Disable Wakeup from STOP.
  * @note   The macro IS_I2C_WAKEUP_FROMSTOP_INSTANCE(I2Cx) can be used to check whether or not
  *         WakeUpFromStop feature is supported by the I2Cx Instance.
  * @rmtoll CR1          WUPEN         LL_I2C_DisableWakeUpFromStop
  * @param  I2Cx I2C Instance.
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_DisableWakeUpFromStop(I2C_TypeDef *I2Cx)
{
  CLEAR_BIT(I2Cx->CR1, I2C_CR1_WUPEN);
}

/**
  * @brief  Check if Wakeup from STOP is enabled or disabled.
  * @note   The macro IS_I2C_WAKEUP_FROMSTOP_INSTANCE(I2Cx) can be used to check whether or not
  *         WakeUpFromStop feature is supported by the I2Cx Instance.
  * @rmtoll CR1          WUPEN         LL_I2C_IsEnabledWakeUpFromStop
  * @param  I2Cx I2C Instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledWakeUpFromStop(I2C_TypeDef *I2Cx)
{
  return ((READ_BIT(I2Cx->CR1, I2C_CR1_WUPEN) == (I2C_CR1_WUPEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set the Own Address1.
  * @param  I2Cx I2C Instance.
  * @param  OwnAddress1 This parameter must be a value between Min_Data=0 and Max_Data=0xFF.
  * @param  OwnAddrSize This parameter is not used, can pass 0.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetOwnAddress1(I2C_TypeDef *I2Cx, uint32_t OwnAddress1, uint32_t OwnAddrSize)
{
  (void)OwnAddrSize;
  MODIFY_REG(I2Cx->OAR1, I2C_OAR1_ADD1_7, OwnAddress1);
}

/**
  * @brief  Configure the Peripheral clock frequency.
  * @rmtoll CR2          FREQ          LL_I2C_SetPeriphClock
  * @param  I2Cx I2C Instance.
  * @param  PeriphClock Peripheral Clock (in Hz)
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetPeriphClock(I2C_TypeDef *I2Cx, uint32_t PeriphClock)
{
  MODIFY_REG(I2Cx->CR2, I2C_CR2_FREQ, __LL_I2C_FREQ_HZ_TO_MHZ(PeriphClock));
}

/**
  * @brief  Get the Peripheral clock frequency.
  * @rmtoll CR2          FREQ          LL_I2C_GetPeriphClock
  * @param  I2Cx I2C Instance.
  * @retval Value of Peripheral Clock (in Hz)
  */
__STATIC_INLINE uint32_t LL_I2C_GetPeriphClock(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(__LL_I2C_FREQ_MHZ_TO_HZ(READ_BIT(I2Cx->CR2, I2C_CR2_FREQ)));
}

/**
  * @brief  Configure the Duty cycle (Fast mode and Fast plus mode).
  * @rmtoll CCR          DUTY          LL_I2C_SetDutyCycle
  * @param  I2Cx I2C Instance.
  * @param  DutyCycle This parameter can be one of the following values:
  *         @arg @ref LL_I2C_DUTYCYCLE_2
  *         @arg @ref LL_I2C_DUTYCYCLE_16_9
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetDutyCycle(I2C_TypeDef *I2Cx, uint32_t DutyCycle)
{
  MODIFY_REG(I2Cx->CCR, I2C_CCR_DUTY, DutyCycle);
}

/**
  * @brief  Get the Duty cycle (Fast mode and Fast plus mode).
  * @rmtoll CCR          DUTY          LL_I2C_GetDutyCycle
  * @param  I2Cx I2C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_DUTYCYCLE_2
  *         @arg @ref LL_I2C_DUTYCYCLE_16_9
  */
__STATIC_INLINE uint32_t LL_I2C_GetDutyCycle(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->CCR, I2C_CCR_DUTY));
}

/**
  * @brief  Configure the I2C master clock speed mode.
  * @rmtoll CCR          FS            LL_I2C_SetClockSpeedMode
  * @rmtoll CCR          FP            LL_I2C_SetClockSpeedMode
  * @param  I2Cx I2C Instance.
  * @param  ClockSpeedMode This parameter can be one of the following values:
  *         @arg @ref LL_I2C_CLOCK_SPEED_STANDARD_MODE
  *         @arg @ref LL_I2C_CLOCK_SPEED_FAST_MODE
  *         @arg @ref LL_I2C_CLOCK_SPEED_FAST_PLUS_MODE
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_SetClockSpeedMode(I2C_TypeDef *I2Cx, uint32_t ClockSpeedMode)
{
  MODIFY_REG(I2Cx->CCR, I2C_CCR_FS | I2C_CCR_FP, ClockSpeedMode);
}

/**
  * @brief  Get the the I2C master speed mode.
  * @rmtoll CCR          FS            LL_I2C_SetClockSpeedMode
  * @rmtoll CCR          FP            LL_I2C_SetClockSpeedMode
  * @param  I2Cx I2C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_CLOCK_SPEED_STANDARD_MODE
  *         @arg @ref LL_I2C_CLOCK_SPEED_FAST_MODE
  *         @arg @ref LL_I2C_CLOCK_SPEED_FAST_PLUS_MODE
  */  
__STATIC_INLINE uint32_t LL_I2C_GetClockSpeedMode(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->CCR, I2C_CCR_FS | I2C_CCR_FP));
}

/**
  * @brief  Configure the SCL, SDA rising time.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll TRISE        TRISE         LL_I2C_SetRiseTime
  * @param  I2Cx I2C Instance.
  * @param  RiseTime This parameter must be a value between Min_Data=0x02 and Max_Data=0x3F.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetRiseTime(I2C_TypeDef *I2Cx, uint32_t RiseTime)
{
  MODIFY_REG(I2Cx->TRISE, I2C_TRISE_TRISE, RiseTime);
}

/**
  * @brief  Get the SCL, SDA rising time.
  * @rmtoll TRISE        TRISE         LL_I2C_GetRiseTime
  * @param  I2Cx I2C Instance.
  * @retval Value between Min_Data=0x02 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_I2C_GetRiseTime(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->TRISE, I2C_TRISE_TRISE));
}

/**
  * @brief  Configure the Data hold time calculate mode.
  * @rmtoll TRISE        THOLDDATA_SEL  LL_I2C_SetDataHoldTimeSel
  * @param  I2Cx I2C Instance.
  * @param  DataHoldTimeSel This parameter can be one of the following values:
  *         @arg @ref LL_I2C_DATA_HOLD_TIME_HARDWARE
  *         @arg @ref LL_I2C_DATA_HOLD_TIME_SOFTWARE
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_SetDataHoldTimeSel(I2C_TypeDef *I2Cx, uint32_t DataHoldTimeSel)
{
  MODIFY_REG(I2Cx->TRISE, I2C_TRISE_THOLDDATA_SEL, DataHoldTimeSel);
}

/**
  * @brief  Get the Data hold time calculate mode.
  * @rmtoll TRISE        THOLDDATA_SEL  LL_I2C_GetDataHoldTimeSel
  * @param  I2Cx I2C Instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_DATA_HOLD_TIME_HARDWARE
  *         @arg @ref LL_I2C_DATA_HOLD_TIME_SOFTWARE
  */  
__STATIC_INLINE uint32_t LL_I2C_GetDataHoldTimeSel(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->TRISE, I2C_TRISE_THOLDDATA_SEL));
}

/**
  * @brief  Configure the Data hold time.
  * @rmtoll TRISE        THOLDDATA      LL_I2C_SetDataHoldTime
  * @param  I2Cx I2C Instance.
  * @param  DataHoldTime This parameter must be a value between Min_Data=0x0 and Max_Data=0x1F.
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_SetDataHoldTime(I2C_TypeDef *I2Cx, uint32_t DataHoldTime)
{
  MODIFY_REG(I2Cx->TRISE, I2C_TRISE_THOLDDATA, (((DataHoldTime)&0x1F) << I2C_TRISE_THOLDDATA_Pos));
}

/**
  * @brief  Get the Data hold time .
  * @rmtoll TRISE        THOLDDATA     LL_I2C_GetDataHoldTime
  * @param  I2Cx I2C Instance.
  * @retval Returned Data Hold Time.
  */  
__STATIC_INLINE uint32_t LL_I2C_GetDataHoldTime(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(0x1F&(READ_BIT(I2Cx->TRISE, I2C_TRISE_THOLDDATA) >> I2C_TRISE_THOLDDATA_Pos));
}

/**
  * @brief  Configure the SCL high and low period.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll CCR          CCR           LL_I2C_SetClockPeriod
  * @param  I2Cx I2C Instance.
  * @param  ClockPeriod This parameter must be a value between Min_Data=0x004 and Max_Data=0xFFF, except in FAST DUTY mode where Min_Data=0x001.
  * @retval None
  */
__STATIC_INLINE void LL_I2C_SetClockPeriod(I2C_TypeDef *I2Cx, uint32_t ClockPeriod)
{
  MODIFY_REG(I2Cx->CCR, I2C_CCR_CCR, ClockPeriod);
}

/**
  * @brief  Get the SCL high and low period.
  * @rmtoll CCR          CCR           LL_I2C_GetClockPeriod
  * @param  I2Cx I2C Instance.
  * @retval Value between Min_Data=0x004 and Max_Data=0xFFF, except in FAST DUTY mode where Min_Data=0x001.
  */
__STATIC_INLINE uint32_t LL_I2C_GetClockPeriod(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->CCR, I2C_CCR_CCR));
}

/**
  * @brief  Configure the clock count value of the wake up timeout.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll WT           CNT           LL_I2C_SetWakeUpTimeOutCounter
  * @param  I2Cx I2C Instance.
  * @param  WakeUpTimeOutCounter This parameter can be one of the following values:
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_2  
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_8  
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_32 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_128
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_SetWakeUpTimeOutCounter(I2C_TypeDef *I2Cx, uint32_t WakeUpTimeOutCounter)
{
  MODIFY_REG(I2Cx->WT, I2C_WT_CNT, WakeUpTimeOutCounter);
}

/**
  * @brief  Get the clock count value of the wake up timeout.
  * @rmtoll WT           CNT           LL_I2C_GetWakeUpTimeOutCounter
  * @param  I2Cx I2C Instance.
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_2  
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_8  
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_32 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_CNT_128
  */
__STATIC_INLINE uint32_t LL_I2C_GetWakeUpTimeOutCounter(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->WT, I2C_WT_CNT));
}

/**
  * @brief  Configure the clock division frequency used to count Wake up timeout times.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll WT           DIV           LL_I2C_SetWakeUpTimeOutDivider
  * @param  I2Cx I2C Instance.
  * @param  WakeUpTimeOutDivider This parameter can be one of the following values:
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_128 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_256 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_512 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_1024
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_SetWakeUpTimeOutDivider(I2C_TypeDef *I2Cx, uint32_t WakeUpTimeOutDivider)
{
  MODIFY_REG(I2Cx->WT, I2C_WT_DIV, WakeUpTimeOutDivider);
}

/**
  * @brief  Get the clock division frequency used to count Wake up timeout times.
  * @rmtoll WT           DIV           LL_I2C_GetWakeUpTimeOutDivider
  * @param  I2Cx I2C Instance.
  * @retval Return value can be one of the following values:
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_128 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_256 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_512 
  *         @arg @ref LL_I2C_WAKEUP_TIMEOUT_DIV_1024
  */  
__STATIC_INLINE uint32_t LL_I2C_GetWakeUpTimeOutDivider(I2C_TypeDef *I2Cx)
{
  return (uint32_t)(READ_BIT(I2Cx->WT, I2C_WT_DIV));
}

/**
  * @brief  Configure the SCL speed.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll CR2          FREQ          LL_I2C_ConfigSpeed\n
  *         TRISE        TRISE         LL_I2C_ConfigSpeed\n
  *         CCR          FS            LL_I2C_ConfigSpeed\n
  *         CCR          FP            LL_I2C_ConfigSpeed\n
  *         CCR          DUTY          LL_I2C_ConfigSpeed\n
  *         CCR          CCR           LL_I2C_ConfigSpeed
  * @param  I2Cx I2C Instance.
  * @param  PeriphClock Peripheral Clock (in Hz)
  * @param  ClockSpeed This parameter must be a value lower than 1000kHz (in Hz).
  * @param  DutyCycle This parameter can be one of the following values:
  *         @arg @ref LL_I2C_DUTYCYCLE_2
  *         @arg @ref LL_I2C_DUTYCYCLE_16_9
  * @retval None
  */  
__STATIC_INLINE void LL_I2C_ConfigSpeed(I2C_TypeDef *I2Cx, uint32_t PeriphClock, uint32_t ClockSpeed,
                                        uint32_t DutyCycle)
{
  register uint32_t freqrange = 0x0U;
  register uint32_t clockconfig = 0x0U;

  /* Compute frequency range */
  freqrange = __LL_I2C_FREQ_HZ_TO_MHZ(PeriphClock);

